#+TITLE: System Install Steps


* Retrieve Config Files
#+BEGIN_SRC sh :dir ~/
git clone https://github.com/EminUmutGercek/.dotfiles ~/.config/.dotifiles
#+END_SRC
* Installing Doom Emacs
[[https://github.com/hlissner/doom-emacs#install][Github page]]
#+BEGIN_SRC sh :dir ~/
git clone --depth 1 https://github.com/hlissner/doom-emacs ~/.emacs.d
~/.emacs.d/bin/doom install
#+END_SRC
* Copy Doom Emacs Config
#+BEGIN_SRC sh :dir ~/
#cp .doom.d ~/old.doom.d
#rm -rf .doom.d
#cp ~/.config/.dotfiles ~/.doom.d
~/.emacs.d/bin/sync
emacs&
disown
#+END_SRC
* Browser Extensions
** Chrome
*** Video & Audio
**** Audio Pan
**** Video Speed Controller
| Show/hide | controller | V  |   0 |
| Decrease  | speed      | S  | 0.1 |
| Increase  | speed      | D  | 0.1 |
| Rewind    | Z          | 10 |     |
| Advance   | X          | 10 |     |
| Reset     | speed      | R  |   1 |
| Preferred | speed      | G  |   1 |
| Rewind    | H          | 10 |     |
**** Volume Booster
*** Theme
**** Dark Reader
**** Material DevTools Theme Collection
*** BehindTheOverlay
*** Chrome extension source viewer
*** EditThisCookie
*** Extension Manager
*** GNOME Shell integration
*** Google Dictionary (by Google)
*** Grammarly for Chrome
*** JSON Formatter
*** Midnight Lizard
*** MyBib: Free Citation Generator
*** Relay: Chat on Every Website
*** Surfingkeys
*** uBlock Origin
*** Touch VPN - Secure and unlimited VPN
*** Vimium
*** Wappalyzer
*** WhatRuns
*** Wikiwand: Wikipedia Modernized
*** YouTube Playlist Duration
*** C/C++
** Only Firefox
*** Element Blocker
*** Code Copier
*** Flagfox
*** Firefox Multi Account Containers
*** TODO Shortkeys
*** Snap Links
* Gnome Extensions
#+BEGIN_SRC sh  :results verbatim
gnome-extensions list --enabled
#+END_SRC

#+RESULTS:
#+begin_example
notes@maestroschan.fr
alternate-tab@gnome-shell-extensions.gcampax.github.com
scroll-workspaces@gfxmonk.net
remove-alt-tab-delay@tetrafox.pw
tray-icons@zhangkaizhao.com
clipboard-indicator@tudmotu.com
drive-menu@gnome-shell-extensions.gcampax.github.com
sound-output-device-chooser@kgshank.net
remove-dropdown-arrows@mpdeimos.com
putWindow@clemens.lab21.org
extensions@abteil.org
color-picker@tuberry
user-theme@gnome-shell-extensions.gcampax.github.com
#+end_example
